{"convertedBy": "TensorFlow.js Converter v3.3.0", "generatedBy": "keras v2.4.0", "modelTopology": {"backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 4, 4, 13], "dtype": "float32", "ragged": false, "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "TimeDistributed", "config": {"dtype": "float32", "layer": {"class_name": "Flatten", "config": {"dtype": "float32", "data_format": "channels_last", "name": "flatten", "trainable": true}}, "name": "time_distributed", "trainable": true}, "name": "time_distributed", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "dtype": "float32", "noise_shape": null, "seed": null, "name": "dropout"}, "name": "dropout", "inbound_nodes": [[["time_distributed", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"return_sequences": true, "dropout": 0.0, "name": "lstm", "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "unit_forget_bias": true, "return_state": false, "activation": "tanh", "implementation": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 100, "trainable": true, "time_major": false, "recurrent_activation": "sigmoid", "unroll": false}, "name": "lstm", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "dtype": "float32", "noise_shape": null, "seed": null, "name": "dropout_1"}, "name": "dropout_1", "inbound_nodes": [[["lstm", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"return_sequences": false, "dropout": 0.0, "name": "lstm_1", "dtype": "float32", "activity_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "go_backwards": false, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": true, "recurrent_constraint": null, "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "unit_forget_bias": true, "return_state": false, "activation": "tanh", "implementation": 2, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "units": 100, "trainable": true, "time_major": false, "recurrent_activation": "sigmoid", "unroll": false}, "name": "lstm_1", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.1, "dtype": "float32", "noise_shape": null, "seed": null, "name": "dropout_2"}, "name": "dropout_2", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_regularizer": null, "dtype": "float32", "activation": "linear", "kernel_constraint": null, "trainable": true, "use_bias": true, "name": "dense", "activity_regularizer": null, "bias_constraint": null, "units": 39, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "name": "dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"dtype": "float32", "target_shape": [3, 13], "name": "reshape", "trainable": true}, "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"dtype": "float32", "activation": "softmax", "name": "activation", "trainable": true}, "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]]}], "name": "functional_1"}}, "training_config": {"loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"beta_1": 0.8999999761581421, "name": "Adam", "epsilon": 1e-07, "decay": 0.0, "beta_2": 0.9990000128746033, "amsgrad": false, "learning_rate": 0.0010000000474974513}}, "metrics": null, "weighted_metrics": null, "loss": "categorical_crossentropy"}, "keras_version": "2.4.0"}, "format": "layers-model", "weightsManifest": [{"weights": [{"dtype": "float32", "name": "dense/kernel", "shape": [100, 39]}, {"dtype": "float32", "name": "dense/bias", "shape": [39]}, {"dtype": "float32", "name": "lstm/lstm_cell/kernel", "shape": [52, 400]}, {"dtype": "float32", "name": "lstm/lstm_cell/recurrent_kernel", "shape": [100, 400]}, {"dtype": "float32", "name": "lstm/lstm_cell/bias", "shape": [400]}, {"dtype": "float32", "name": "lstm_1/lstm_cell_1/kernel", "shape": [100, 400]}, {"dtype": "float32", "name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [100, 400]}, {"dtype": "float32", "name": "lstm_1/lstm_cell_1/bias", "shape": [400]}], "paths": ["group1-shard1of1.bin"]}]}