{"generatedBy": "keras v2.4.0", "weightsManifest": [{"weights": [{"shape": [100, 13], "name": "dense/kernel", "dtype": "float32"}, {"shape": [13], "name": "dense/bias", "dtype": "float32"}, {"shape": [13, 400], "name": "lstm/lstm_cell/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm/lstm_cell/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm/lstm_cell/bias", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_1/lstm_cell_1/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_1/lstm_cell_1/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm_1/lstm_cell_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "format": "layers-model", "convertedBy": "TensorFlow.js Converter v3.3.0", "modelTopology": {"model_config": {"class_name": "Functional", "config": {"output_layers": [["activation", 0, 0]], "layers": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [1, 3, 13], "name": "input_1", "dtype": "float32", "ragged": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "LSTM", "config": {"use_bias": true, "bias_constraint": null, "return_sequences": true, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "trainable": true, "name": "lstm", "return_state": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "stateful": true, "dtype": "float32", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "unroll": false, "go_backwards": false, "activation": "tanh", "time_major": false, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "units": 100}, "name": "lstm", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.1, "name": "dropout", "seed": null}, "name": "dropout", "inbound_nodes": [[["lstm", 0, 0, {}]]]}, {"class_name": "LSTM", "config": {"use_bias": true, "bias_constraint": null, "return_sequences": false, "implementation": 2, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_dropout": 0.0, "unit_forget_bias": true, "trainable": true, "name": "lstm_1", "return_state": false, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "stateful": true, "dtype": "float32", "bias_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "recurrent_constraint": null, "recurrent_activation": "sigmoid", "unroll": false, "go_backwards": false, "activation": "tanh", "time_major": false, "kernel_regularizer": null, "activity_regularizer": null, "recurrent_regularizer": null, "units": 100}, "name": "lstm_1", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"noise_shape": null, "dtype": "float32", "trainable": true, "rate": 0.1, "name": "dropout_1", "seed": null}, "name": "dropout_1", "inbound_nodes": [[["lstm_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "units": 13, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "name": "dense", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "dtype": "float32", "activity_regularizer": null, "bias_regularizer": null}, "name": "dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"target_shape": [13], "name": "reshape", "dtype": "float32", "trainable": true}, "name": "reshape", "inbound_nodes": [[["dense", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation", "activation": "softmax", "dtype": "float32", "trainable": true}, "name": "activation", "inbound_nodes": [[["reshape", 0, 0, {}]]]}], "name": "functional_1", "input_layers": [["input_1", 0, 0]]}}, "training_config": {"loss_weights": null, "loss": "categorical_crossentropy", "weighted_metrics": null, "metrics": null, "optimizer_config": {"class_name": "Adam", "config": {"decay": 0.0, "epsilon": 1e-07, "amsgrad": false, "beta_1": 0.8999999761581421, "name": "Adam", "learning_rate": 0.0010000000474974513, "beta_2": 0.9990000128746033}}}, "backend": "tensorflow", "keras_version": "2.4.0"}}