{"format": "layers-model", "weightsManifest": [{"weights": [{"name": "dense/kernel", "dtype": "float32", "shape": [256, 50]}, {"name": "dense/bias", "dtype": "float32", "shape": [50]}, {"name": "dense_1/kernel", "dtype": "float32", "shape": [1, 50]}, {"name": "dense_1/bias", "dtype": "float32", "shape": [50]}, {"name": "dense_2/kernel", "dtype": "float32", "shape": [700, 100]}, {"name": "dense_2/bias", "dtype": "float32", "shape": [100]}, {"name": "dense_3/kernel", "dtype": "float32", "shape": [100, 39]}, {"name": "dense_3/bias", "dtype": "float32", "shape": [39]}, {"name": "dense_4/kernel", "dtype": "float32", "shape": [39, 13]}, {"name": "dense_4/bias", "dtype": "float32", "shape": [13]}, {"name": "dense_5/kernel", "dtype": "float32", "shape": [39, 13]}, {"name": "dense_5/bias", "dtype": "float32", "shape": [13]}, {"name": "dense_6/kernel", "dtype": "float32", "shape": [39, 13]}, {"name": "dense_6/bias", "dtype": "float32", "shape": [13]}, {"name": "lstm/lstm_cell/kernel", "dtype": "float32", "shape": [52, 1024]}, {"name": "lstm/lstm_cell/recurrent_kernel", "dtype": "float32", "shape": [256, 1024]}, {"name": "lstm/lstm_cell/bias", "dtype": "float32", "shape": [1024]}], "paths": ["group1-shard1of1.bin"]}], "modelTopology": {"model_config": {"config": {"output_layers": [["dense_4", 0, 0], ["dense_5", 0, 0], ["dense_6", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"batch_input_shape": [1, 4, 4, 13], "ragged": false, "sparse": false, "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "reshape", "config": {"target_shape": [4, 52], "name": "reshape", "dtype": "float32", "trainable": true}, "class_name": "Reshape"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "name": "lstm", "config": {"implementation": 2, "use_bias": true, "unit_forget_bias": true, "kernel_regularizer": null, "return_state": false, "trainable": true, "recurrent_activation": "sigmoid", "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_dropout": 0.0, "time_major": false, "bias_constraint": null, "activation": "tanh", "recurrent_regularizer": null, "activity_regularizer": null, "go_backwards": false, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "units": 256, "kernel_constraint": null, "stateful": true, "name": "lstm", "unroll": false, "dropout": 0.0, "return_sequences": false, "bias_regularizer": null, "recurrent_constraint": null, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "class_name": "LSTM"}, {"inbound_nodes": [], "name": "input_2", "config": {"batch_input_shape": [1, 13, 1], "ragged": false, "sparse": false, "name": "input_2", "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["lstm", 0, 0, {}]]], "name": "dropout", "config": {"seed": null, "dtype": "float32", "trainable": true, "noise_shape": null, "name": "dropout", "rate": 0.2}, "class_name": "Dropout"}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "dense_1", "config": {"activation": "linear", "name": "dense_1", "use_bias": true, "units": 50, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "name": "dense", "config": {"activation": "relu", "name": "dense", "use_bias": true, "units": 50, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "flatten", "config": {"data_format": "channels_last", "name": "flatten", "dtype": "float32", "trainable": true}, "class_name": "Flatten"}, {"inbound_nodes": [[["dense", 0, 0, {}], ["flatten", 0, 0, {}]]], "name": "concatenate", "config": {"axis": -1, "name": "concatenate", "dtype": "float32", "trainable": true}, "class_name": "Concatenate"}, {"inbound_nodes": [[["concatenate", 0, 0, {}]]], "name": "dense_2", "config": {"activation": "relu", "name": "dense_2", "use_bias": true, "units": 100, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "dropout_1", "config": {"seed": null, "dtype": "float32", "trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.2}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "name": "dense_3", "config": {"activation": "sigmoid", "name": "dense_3", "use_bias": true, "units": 39, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "dropout_2", "config": {"seed": null, "dtype": "float32", "trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.2}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_4", "config": {"activation": "softmax", "name": "dense_4", "use_bias": true, "units": 13, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_5", "config": {"activation": "softmax", "name": "dense_5", "use_bias": true, "units": 13, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}, {"inbound_nodes": [[["dropout_2", 0, 0, {}]]], "name": "dense_6", "config": {"activation": "softmax", "name": "dense_6", "use_bias": true, "units": 13, "kernel_regularizer": null, "bias_constraint": null, "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}, "class_name": "Dense"}], "name": "functional_5"}, "class_name": "Functional"}, "keras_version": "2.4.0", "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "optimizer_config": {"config": {"amsgrad": false, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "decay": 0.0, "name": "Adam", "learning_rate": 0.0010000000474974513}, "class_name": "Adam"}, "metrics": null, "weighted_metrics": null}, "backend": "tensorflow"}, "convertedBy": "TensorFlow.js Converter v3.3.0", "generatedBy": "keras v2.4.0"}