{"weightsManifest": [{"weights": [{"shape": [100, 26], "name": "dense/kernel", "dtype": "float32"}, {"shape": [26], "name": "dense/bias", "dtype": "float32"}, {"shape": [26, 400], "name": "lstm/lstm_cell/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm/lstm_cell/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm/lstm_cell/bias", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_1/lstm_cell_1/kernel", "dtype": "float32"}, {"shape": [100, 400], "name": "lstm_1/lstm_cell_1/recurrent_kernel", "dtype": "float32"}, {"shape": [400], "name": "lstm_1/lstm_cell_1/bias", "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "generatedBy": "keras v2.4.0", "format": "layers-model", "modelTopology": {"model_config": {"config": {"input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "config": {"ragged": false, "batch_input_shape": [1, null, 26], "sparse": false, "dtype": "float32", "name": "input_1"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"kernel_constraint": null, "return_sequences": true, "bias_regularizer": null, "dtype": "float32", "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "recurrent_activation": "sigmoid", "units": 100, "use_bias": true, "time_major": false, "name": "lstm", "unroll": false, "unit_forget_bias": true, "trainable": true, "dropout": 0.0, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "implementation": 2, "stateful": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "recurrent_dropout": 0.0}, "name": "lstm", "class_name": "LSTM"}, {"inbound_nodes": [[["lstm", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.1, "seed": null, "dtype": "float32", "noise_shape": null, "name": "dropout"}, "name": "dropout", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout", 0, 0, {}]]], "config": {"kernel_constraint": null, "return_sequences": false, "bias_regularizer": null, "dtype": "float32", "recurrent_regularizer": null, "kernel_regularizer": null, "return_state": false, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "recurrent_activation": "sigmoid", "units": 100, "use_bias": true, "time_major": false, "name": "lstm_1", "unroll": false, "unit_forget_bias": true, "trainable": true, "dropout": 0.0, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_constraint": null, "implementation": 2, "stateful": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "bias_constraint": null, "go_backwards": false, "activity_regularizer": null, "recurrent_dropout": 0.0}, "name": "lstm_1", "class_name": "LSTM"}, {"inbound_nodes": [[["lstm_1", 0, 0, {}]]], "config": {"trainable": true, "rate": 0.1, "seed": null, "dtype": "float32", "noise_shape": null, "name": "dropout_1"}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"trainable": true, "kernel_constraint": null, "bias_regularizer": null, "dtype": "float32", "kernel_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "use_bias": true, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 26, "name": "dense", "bias_constraint": null, "activity_regularizer": null}, "name": "dense", "class_name": "Dense"}, {"inbound_nodes": [[["dense", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "reshape", "target_shape": [26]}, "name": "reshape", "class_name": "Reshape"}, {"inbound_nodes": [[["reshape", 0, 0, {}]]], "config": {"trainable": true, "dtype": "float32", "name": "activation", "activation": "softmax"}, "name": "activation", "class_name": "Activation"}], "output_layers": [["activation", 0, 0]], "name": "functional_1"}, "class_name": "Functional"}, "keras_version": "2.4.0", "training_config": {"metrics": null, "optimizer_config": {"config": {"decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "amsgrad": false, "learning_rate": 0.0010000000474974513, "epsilon": 1e-07, "name": "Adam"}, "class_name": "Adam"}, "loss": "categorical_crossentropy", "weighted_metrics": null, "loss_weights": null}, "backend": "tensorflow"}, "convertedBy": "TensorFlow.js Converter v3.3.0"}