{"modelTopology": {"keras_version": "2.4.0", "training_config": {"optimizer_config": {"config": {"learning_rate": 0.0010000000474974513, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "name": "Adam", "decay": 0.0, "beta_1": 0.8999999761581421, "amsgrad": false}, "class_name": "Adam"}, "metrics": null, "loss_weights": null, "weighted_metrics": null, "loss": "categorical_crossentropy"}, "backend": "tensorflow", "model_config": {"config": {"name": "functional_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["activation", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "ragged": false, "batch_input_shape": [1, 4, 4, 13], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "time_distributed", "config": {"name": "time_distributed", "layer": {"config": {"name": "flatten", "data_format": "channels_last", "trainable": true, "dtype": "float32"}, "class_name": "Flatten"}, "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "TimeDistributed"}, {"name": "dropout", "config": {"dtype": "float32", "name": "dropout", "seed": null, "rate": 0.1, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["time_distributed", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "lstm", "config": {"time_major": false, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "unroll": false, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": true, "return_state": false, "recurrent_constraint": null, "go_backwards": false, "name": "lstm", "kernel_regularizer": null, "return_sequences": true, "use_bias": true, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 2, "recurrent_activation": "sigmoid", "units": 100, "dropout": 0.0}, "inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout_1", "config": {"dtype": "float32", "name": "dropout_1", "seed": null, "rate": 0.1, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["lstm", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "lstm_1", "config": {"time_major": false, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "kernel_constraint": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "recurrent_regularizer": null, "recurrent_dropout": 0.0, "dtype": "float32", "unroll": false, "activation": "tanh", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "stateful": true, "return_state": false, "recurrent_constraint": null, "go_backwards": false, "name": "lstm_1", "kernel_regularizer": null, "return_sequences": false, "use_bias": true, "unit_forget_bias": true, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "implementation": 2, "recurrent_activation": "sigmoid", "units": 100, "dropout": 0.0}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "LSTM"}, {"name": "dropout_2", "config": {"dtype": "float32", "name": "dropout_2", "seed": null, "rate": 0.1, "trainable": true, "noise_shape": null}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout"}, {"name": "dense", "config": {"activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "name": "dense", "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "use_bias": true, "dtype": "float32", "kernel_constraint": null, "units": 39, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear"}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "reshape", "config": {"name": "reshape", "target_shape": [3, 13], "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "activation", "config": {"name": "activation", "activation": "softmax", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Activation"}]}, "class_name": "Functional"}}, "weightsManifest": [{"weights": [{"name": "dense/kernel", "shape": [100, 39], "dtype": "float32"}, {"name": "dense/bias", "shape": [39], "dtype": "float32"}, {"name": "lstm/lstm_cell/kernel", "shape": [52, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm/lstm_cell/bias", "shape": [400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/recurrent_kernel", "shape": [100, 400], "dtype": "float32"}, {"name": "lstm_1/lstm_cell_1/bias", "shape": [400], "dtype": "float32"}], "paths": ["group1-shard1of1.bin"]}], "convertedBy": "TensorFlow.js Converter v3.3.0", "format": "layers-model", "generatedBy": "keras v2.4.0"}