{"generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.3.0", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [100, 13], "dtype": "float32", "name": "dense/kernel"}, {"shape": [13], "dtype": "float32", "name": "dense/bias"}, {"shape": [13, 400], "dtype": "float32", "name": "lstm/lstm_cell_2/kernel"}, {"shape": [100, 400], "dtype": "float32", "name": "lstm/lstm_cell_2/recurrent_kernel"}, {"shape": [400], "dtype": "float32", "name": "lstm/lstm_cell_2/bias"}, {"shape": [100, 400], "dtype": "float32", "name": "lstm_1/lstm_cell_3/kernel"}, {"shape": [100, 400], "dtype": "float32", "name": "lstm_1/lstm_cell_3/recurrent_kernel"}, {"shape": [400], "dtype": "float32", "name": "lstm_1/lstm_cell_3/bias"}]}], "format": "layers-model", "modelTopology": {"model_config": {"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["activation", 0, 0]], "layers": [{"config": {"sparse": false, "batch_input_shape": [1, null, 13], "dtype": "float32", "ragged": false, "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer", "name": "input_1"}, {"config": {"bias_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "return_sequences": true, "recurrent_activation": "sigmoid", "time_major": false, "kernel_constraint": null, "unit_forget_bias": true, "dtype": "float32", "stateful": true, "return_state": false, "activation": "tanh", "name": "lstm", "use_bias": true, "implementation": 2, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "dropout": 0.0, "bias_regularizer": null, "units": 100, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm"}, {"config": {"seed": null, "name": "dropout", "noise_shape": null, "rate": 0.1, "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["lstm", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout"}, {"config": {"bias_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "return_sequences": false, "recurrent_activation": "sigmoid", "time_major": false, "kernel_constraint": null, "unit_forget_bias": true, "dtype": "float32", "stateful": true, "return_state": false, "activation": "tanh", "name": "lstm_1", "use_bias": true, "implementation": 2, "trainable": true, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "recurrent_constraint": null, "recurrent_dropout": 0.0, "dropout": 0.0, "bias_regularizer": null, "units": 100, "activity_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}}, "inbound_nodes": [[["dropout", 0, 0, {}]]], "class_name": "LSTM", "name": "lstm_1"}, {"config": {"seed": null, "name": "dropout_1", "noise_shape": null, "rate": 0.1, "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["lstm_1", 0, 0, {}]]], "class_name": "Dropout", "name": "dropout_1"}, {"config": {"bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "name": "dense", "use_bias": true, "trainable": true, "kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"config": {"seed": null}, "class_name": "GlorotUniform"}, "activity_regularizer": null, "kernel_constraint": null, "units": 13, "dtype": "float32"}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense"}, {"config": {"trainable": true, "target_shape": [13], "dtype": "float32", "name": "reshape"}, "inbound_nodes": [[["dense", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape"}, {"config": {"trainable": true, "activation": "softmax", "dtype": "float32", "name": "activation"}, "inbound_nodes": [[["reshape", 0, 0, {}]]], "class_name": "Activation", "name": "activation"}], "name": "functional_1"}, "class_name": "Functional"}, "backend": "tensorflow", "training_config": {"metrics": null, "loss": "categorical_crossentropy", "optimizer_config": {"config": {"beta_1": 0.9, "learning_rate": 0.001, "name": "Adam", "decay": 0.0, "amsgrad": false, "beta_2": 0.999, "epsilon": 1e-07}, "class_name": "Adam"}, "loss_weights": null, "weighted_metrics": null}, "keras_version": "2.4.0"}}